In [3]:
from recommenders.utils.python_utils import binarize
from recommenders.utils.timer import Timer
#from recommenders.datasets import movielens
from recommenders.datasets.python_splitters import python_stratified_split
from recommenders.datasets.spark_splitters import spark_random_split
from recommenders.evaluation.python_evaluation import (
    map_at_k,
    ndcg_at_k,
    precision_at_k,
    recall_at_k,
    rmse,
    mae,
    logloss,
    rsquared,
    exp_var
)
from recommenders.models.sar import SAR
import sys

import logging
import numpy as np
import pandas as pd
#import scrapbook as sb
from sklearn.preprocessing import minmax_scale
import numpy as np
import pandas as pd

In [4]:
# Visualisations
# (a) ggplot-like graphs for EDA
from plotnine import *
import plotnine
plotnine.options.figure_size = (5.2,3.2)
# (b) for plotting other plots
import seaborn as sns
sns.set()
import matplotlib.pyplot as plt
%matplotlib inline

# Ignore warnings
import warnings
warnings.filterwarnings('ignore')

In [5]:
import pymongo
import pickle
from pymongo import MongoClient

In [6]:
# setting random seed for notebook reproducability
import random

seed = 123
random.seed(seed)
np.random.seed(seed)

In [7]:
# load datasets
ass = pd.read_csv('./dataset/input/open-university-learning-analytics-dataset/assessments.csv')
courses = pd.read_csv('./dataset/input/open-university-learning-analytics-dataset/courses.csv')
results = pd.read_csv('./dataset/input/open-university-learning-analytics-dataset/studentAssessment.csv')
info = pd.read_csv('./dataset/input/open-university-learning-analytics-dataset/studentInfo.csv')
reg = pd.read_csv('./dataset/input/open-university-learning-analytics-dataset/studentRegistration.csv')
vle = pd.read_csv('./dataset/input/open-university-learning-analytics-dataset/studentVle.csv')
materials = pd.read_csv('./dataset/input/open-university-learning-analytics-dataset/vle.csv')

In [8]:
ass.head()

  code_module code_presentation  id_assessment assessment_type   date  weight
0         AAA             2013J           1752             TMA   19.0    10.0
1         AAA             2013J           1753             TMA   54.0    20.0
2         AAA             2013J           1754             TMA  117.0    20.0
3         AAA             2013J           1755             TMA  166.0    20.0
4         AAA             2013J           1756             TMA  215.0    30.0

In [9]:

condi=ass[["code_module","code_presentation","assessment_type","weight"]]

In [10]:
condi

    code_module code_presentation assessment_type  weight
0           AAA             2013J             TMA    10.0
1           AAA             2013J             TMA    20.0
2           AAA             2013J             TMA    20.0
3           AAA             2013J             TMA    20.0
4           AAA             2013J             TMA    30.0
..          ...               ...             ...     ...
201         GGG             2014J             CMA     0.0
202         GGG             2014J             TMA     0.0
203         GGG             2014J             TMA     0.0
204         GGG             2014J             TMA     0.0
205         GGG             2014J            Exam   100.0

[206 rows x 4 columns]

In [11]:
condi.to_excel("conditionv2.xlsx")

In [14]:
#merge two table assessments and modules
assResults = pd.merge(ass, results, on=['id_assessment'], how='inner')
#check module code and its assessments
assResults[["code_module","assessment_type"]].drop_duplicates()

       code_module assessment_type
0              AAA             TMA
3149           BBB             CMA
8198           BBB             TMA
46181          CCC             CMA
50101          CCC             TMA
52923          CCC            Exam
65121          DDD             CMA
70373          DDD             TMA
74892          DDD            Exam
95985          EEE             TMA
103878         FFF             CMA
110559         FFF             TMA
158693         GGG             CMA
162442         GGG             TMA

In [15]:
info['id_student'] = info['id_student'].astype(object)

In [16]:
regCourses = pd.merge(reg, courses, on=['code_module', 'code_presentation'], how='inner')

regCourses.head()

,code_module,code_presentation,id_student,date_registration,date_unregistration,module_presentation_length
0,AAA,2013J,11391,-159.0,NaN,268
1,AAA,2013J,28400,-53.0,NaN,268
2,AAA,2013J,30268,-92.0,12.0,268
3,AAA,2013J,31604,-52.0,NaN,268
4,AAA,2013J,32885,-176.0,NaN,268

In [17]:
# Merge with an inner join
regCoursesInfo = pd.merge(regCourses, info, on=['code_module', 'code_presentation', 'id_student'], how='inner')
#checking info
regCoursesInfo[regCoursesInfo['id_student'] == 30268]

,code_module,code_presentation,id_student,date_registration,date_unregistration,module_presentation_length,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
2,AAA,2013J,30268,-92.0,12.0,268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn

In [18]:
df=regCoursesInfo.groupby(['id_student'])['code_module']\
                .agg('count').reset_index()\
                .sort_values('code_module',ascending=False)

In [19]:
df[df['code_module']!=1]

       id_student  code_module
13484      584077            5
1145       157310            4
11490      565275            4
1285       172965            4
18829      624126            4
...           ...          ...
15245      596614            2
17033      608422            2
14515      591581            2
26668     2039190            2
14426      590867            2

[3538 rows x 2 columns]

In [20]:
# merge with an inner join
assResults = pd.merge(ass, results, on=['id_assessment'], how='inner')
# Rearrange column names
assResults = assResults[['id_student', 'code_module','assessment_type','weight', 'score','code_presentation']]
assResults_ass=assResults[assResults["assessment_type"]!="Exam"]
# (a) Add column multiplying weight and score
assResults_ass['weight*score'] = assResults_ass['weight']*assResults_ass['score']
#

In [21]:
assResults_ass

,id_student,code_module,assessment_type,weight,score,code_presentation,weight*score
0,11391,AAA,TMA,10.0,78.0,2013J,780.0
1,28400,AAA,TMA,10.0,70.0,2013J,700.0
2,31604,AAA,TMA,10.0,72.0,2013J,720.0
3,32885,AAA,TMA,10.0,69.0,2013J,690.0
4,38053,AAA,TMA,10.0,79.0,2013J,790.0
...,...,...,...,...,...,...,...
173907,652462,GGG,TMA,0.0,60.0,2014J,0.0
173908,652539,GGG,TMA,0.0,75.0,2014J,0.0
173909,653157,GGG,TMA,0.0,70.0,2014J,0.0
173910,653252,GGG,TMA,0.0,70.0,2014J,0.0
173911,653374,GGG,TMA,0.0,50.0,2014J,0.0

In [22]:
assResults_ass[assResults_ass["assessment_type"]=="CMA"].code_module.unique()

array(['BBB', 'CCC', 'DDD', 'FFF', 'GGG'], dtype=object)

In [23]:
# Merge with an inner join
regCourses = pd.merge(reg, courses, on=['code_module', 'code_presentation'], how='inner')

regCourses.head()

,code_module,code_presentation,id_student,date_registration,date_unregistration,module_presentation_length
0,AAA,2013J,11391,-159.0,NaN,268
1,AAA,2013J,28400,-53.0,NaN,268
2,AAA,2013J,30268,-92.0,12.0,268
3,AAA,2013J,31604,-52.0,NaN,268
4,AAA,2013J,32885,-176.0,NaN,268

In [24]:
# merge with an inner join
assResults = pd.merge(ass, results, on=['id_assessment'], how='inner')
# Rearrange column names
assResults = assResults[['id_student', 'code_module', 'code_presentation', 'id_assessment', 'assessment_type', 'date', 'date_submitted', 'weight', 'is_banked', 'score']]

In [25]:
# Merge with an inner join
VLEmaterials = pd.merge(vle, materials, on=['code_module', 'code_presentation', 'id_site'], how='inner')
# Drop columns
VLEmaterials.drop(columns=['week_from', 'week_to', 'date'], inplace=True)

VLEmaterials.head()

total_click_per_student = VLEmaterials\
.groupby(['code_module', 'code_presentation', 'id_student'])\
.agg(total_click = ("sum_click",sum))\
.reset_index()

In [26]:
# Make a copy of dataset
scores = assResults

# Count how many exams there are in Results for every module presentation
scores[scores['assessment_type'] == 'Exam'][['code_module', 'code_presentation', 'id_assessment']]\
.groupby(['code_module', 'code_presentation'])\
.nunique()

                               id_assessment
code_module code_presentation
CCC         2014B                          1
            2014J                          1
DDD         2013B                          1
            2013J                          1
            2014B                          1
            2014J                          1

In [27]:
# Make helper columns

# Add column multiplying weight and score
scores['weight*score'] = scores['weight']*scores['score']
# Aggregate recorded weight*score per student per module presentation
sum_scores = scores\
            .groupby(['id_student', 'code_module', 'code_presentation'])\
            .agg(weightByScore = ('weight*score', sum))\
            .reset_index()
# Calculate total recorded weight of module
# Get total weight of modules
total_weight = ass\
            .groupby(['code_module', 'code_presentation'])\
            .agg(total_weight = ('weight', sum))\
            .reset_index()
# (c.ii) Subtract 100 to account for missing exams
total_weight['total_weight'] = total_weight['total_weight']-100
# (c.iii) Mark module DDD as having 200 credits 
total_weight.loc[(total_weight.code_module == 'DDD'), 'total_weight'] = 200

In [28]:
# Calculate weighted score
# Merge sum_scores and total_weight tables
score_weights = pd.merge(sum_scores, total_weight, on=['code_module', 'code_presentation'], how='inner')
# Calculate weighted score
score_weights['weighted_score'] = score_weights['weightByScore'] / score_weights['total_weight']
# Drop helper columns
score_weights.drop(columns=['weightByScore', 'total_weight'], inplace=True)
# Calculate the difference between the submission dates
lateSubmission = assResults.assign(submission_days=assResults['date_submitted']-assResults['date'])
# Make a column indicating if the submission was late or not 
lateSubmission = lateSubmission.assign(late_submission=lateSubmission['submission_days'] > 0)

lateSubmission.head()

,id_student,code_module,code_presentation,id_assessment,assessment_type,date,date_submitted,weight,is_banked,score,weight*score,submission_days,late_submission
0,11391,AAA,2013J,1752,TMA,19.0,18,10.0,0,78.0,780.0,-1.0,False
1,28400,AAA,2013J,1752,TMA,19.0,22,10.0,0,70.0,700.0,3.0,True
2,31604,AAA,2013J,1752,TMA,19.0,17,10.0,0,72.0,720.0,-2.0,False
3,32885,AAA,2013J,1752,TMA,19.0,26,10.0,0,69.0,690.0,7.0,True
4,38053,AAA,2013J,1752,TMA,19.0,19,10.0,0,79.0,790.0,0.0,False

In [29]:
# Aggregate per student per module presentation
total_late_per_student = lateSubmission\
.groupby(['id_student', 'code_module', 'code_presentation'])\
.agg(total_late_submission = ('late_submission', sum))\
.reset_index()

total_late_per_student.head()
# Make a df with total number of all assessments per student per module presentation
total_count_assessments = lateSubmission[['id_student', 'code_module', 'code_presentation', 'id_assessment']]\
.groupby(['id_student', 'code_module', 'code_presentation'])\
.size()\
.reset_index(name='total_assessments')

total_count_assessments.head()
# Merge df with total late assessements and total count assessments
late_rate_per_student = pd.merge(total_late_per_student, total_count_assessments, on=['id_student', 'code_module', 'code_presentation'], how='inner')
# Make a new column with late submission rate
late_rate_per_student['late_rate'] = late_rate_per_student['total_late_submission'] / late_rate_per_student['total_assessments']
# Drop helper columns
late_rate_per_student.drop(columns=['total_late_submission', 'total_assessments'], inplace=True)

late_rate_per_student.head()

   id_student code_module code_presentation  late_rate
0        6516         AAA             2014J   0.000000
1        8462         DDD             2013J   0.333333
2        8462         DDD             2014J   0.000000
3       11391         AAA             2013J   0.000000
4       23629         BBB             2013B   0.750000

In [30]:
# Define function for marking failed assignments
passRate = assResults
passRate = passRate.assign(fail=passRate['score'] < 40)
# Aggregate per student per module presentation
total_fails_per_student = passRate\
.groupby(['id_student', 'code_module', 'code_presentation'])\
.agg(total_fails = ("fail",sum))\
.reset_index()

total_fails_per_student.head()

   id_student code_module code_presentation  total_fails
0        6516         AAA             2014J            0
1        8462         DDD             2013J            0
2        8462         DDD             2014J            0
3       11391         AAA             2013J            0
4       23629         BBB             2013B            0

In [31]:
# Merge df with total fails and total count assessments
fail_rate_per_student = pd.merge(total_fails_per_student, total_count_assessments, on=['id_student', 'code_module', 'code_presentation'], how='inner')
# Make a new column with late submission rate
fail_rate_per_student['fail_rate'] = fail_rate_per_student['total_fails'] / fail_rate_per_student['total_assessments']
# Drop helper columns
fail_rate_per_student.drop(columns=['total_fails', 'total_assessments'], inplace=True)

fail_rate_per_student

       id_student code_module code_presentation  fail_rate
0            6516         AAA             2014J       0.00
1            8462         DDD             2013J       0.00
2            8462         DDD             2014J       0.00
3           11391         AAA             2013J       0.00
4           23629         BBB             2013B       0.00
...           ...         ...               ...        ...
25838     2698257         AAA             2013J       0.00
25839     2698535         CCC             2014B       0.75
25840     2698535         EEE             2013J       0.25
25841     2698577         BBB             2014J       0.00
25842     2698588         BBB             2014J       0.00

[25843 rows x 4 columns]

In [32]:
assessments = pd.merge(score_weights, late_rate_per_student, on=['id_student', 'code_module', 'code_presentation'], how='inner')
assessments = pd.merge(assessments, fail_rate_per_student, on=['id_student', 'code_module', 'code_presentation'], how='inner')

assessments.head()

,id_student,code_module,code_presentation,weighted_score,late_rate,fail_rate
0,6516,AAA,2014J,63.5,0.0,0.0
1,24734,AAA,2014J,47.5,0.8,0.2
2,26192,AAA,2014J,86.3,0.0,0.0
3,28061,AAA,2014J,77.4,0.2,0.0
4,31600,AAA,2014J,55.5,0.6,0.0

In [33]:
merged = pd.merge(regCoursesInfo, total_click_per_student, on=['id_student', 'code_module', 'code_presentation'], how='left')

merged.head()

,code_module,code_presentation,id_student,date_registration,date_unregistration,module_presentation_length,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result,total_click
0,AAA,2013J,11391,-159.0,NaN,268,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,934.0
1,AAA,2013J,28400,-53.0,NaN,268,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass,1435.0
2,AAA,2013J,30268,-92.0,12.0,268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn,281.0
3,AAA,2013J,31604,-52.0,NaN,268,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass,2158.0
4,AAA,2013J,32885,-176.0,NaN,268,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass,1034.0

In [34]:
final_data = pd.merge(merged, assessments, on=['id_student', 'code_module', 'code_presentation'], how='left')
#final_data.weighted_score=final_data.weighted_score.fillna(0)
final_data.weighted_score=final_data.weighted_score.dropna()
final_data=final_data[~(((final_data["final_result"]=='Pass') | (final_data["final_result"]=='Distinction') ) & (final_data["weighted_score"]==0))].drop_duplicates()
#(subset=['code_module','code_presentation','id_student'])
final_data

,code_module,code_presentation,id_student,date_registration,date_unregistration,module_presentation_length,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result,total_click,weighted_score,late_rate,fail_rate
0,AAA,2013J,11391,-159.0,NaN,268,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,934.0,82.4,0.000000,0.0
1,AAA,2013J,28400,-53.0,NaN,268,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass,1435.0,65.4,0.400000,0.0
2,AAA,2013J,30268,-92.0,12.0,268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn,281.0,NaN,NaN,NaN
3,AAA,2013J,31604,-52.0,NaN,268,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass,2158.0,76.3,0.000000,0.0
4,AAA,2013J,32885,-176.0,NaN,268,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass,1034.0,55.0,1.000000,0.4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32588,GGG,2014J,2640965,-4.0,NaN,269,F,Wales,Lower Than A Level,10-20,0-35,0,30,N,Fail,41.0,NaN,NaN,NaN
32589,GGG,2014J,2645731,-23.0,NaN,269,F,East Anglian Region,Lower Than A Level,40-50%,35-55,0,30,N,Distinction,893.0,NaN,0.222222,0.0
32590,GGG,2014J,2648187,-129.0,NaN,269,F,South Region,A Level or Equivalent,20-30%,0-35,0,30,Y,Pass,312.0,NaN,0.000000,0.0
32591,GGG,2014J,2679821,-49.0,101.0,269,F,South East Region,Lower Than A Level,90-100%,35-55,0,30,N,Withdrawn,275.0,NaN,0.000000,0.0
32592,GGG,2014J,2684003,-28.0,NaN,269,F,Yorkshire Region,HE Qualification,50-60%,35-55,0,30,N,Distinction,616.0,NaN,0.000000,0.0

In [35]:
final_data.region.unique()

array(['East Anglian Region', 'Scotland', 'North Western Region',
       'South East Region', 'West Midlands Region', 'Wales',
       'North Region', 'South Region', 'Ireland', 'South West Region',
       'East Midlands Region', 'Yorkshire Region', 'London Region'],
      dtype=object)

In [36]:
final_data[final_data.weighted_score==0].final_result.nunique()

2

In [37]:
final_data[final_data["weighted_score"]==0]

,code_module,code_presentation,id_student,date_registration,date_unregistration,module_presentation_length,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result,total_click,weighted_score,late_rate,fail_rate
227,AAA,2013J,721259,-73.0,23.0,268,F,South Region,Lower Than A Level,50-60%,55<=,0,120,N,Withdrawn,1228.0,0.0,1.0,0.0
843,BBB,2013B,186780,-117.0,213.0,240,F,North Western Region,A Level or Equivalent,10-20,35-55,2,120,Y,Withdrawn,30.0,0.0,1.0,0.0
1981,BBB,2013B,549713,-29.0,57.0,240,F,West Midlands Region,Lower Than A Level,0-10%,35-55,0,60,Y,Withdrawn,75.0,0.0,1.0,0.0
2112,BBB,2013B,554393,-15.0,NaN,240,M,West Midlands Region,A Level or Equivalent,20-30%,35-55,0,60,N,Fail,21.0,0.0,1.0,0.0
4681,BBB,2013J,2459051,-60.0,NaN,268,F,North Western Region,Lower Than A Level,10-20,35-55,1,60,N,Fail,52.0,0.0,1.0,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28812,FFF,2014J,647417,-77.0,12.0,269,M,West Midlands Region,A Level or Equivalent,10-20,0-35,0,120,Y,Withdrawn,173.0,0.0,0.0,0.0
28914,FFF,2014J,649555,-88.0,11.0,269,M,South Region,Lower Than A Level,50-60%,0-35,0,120,N,Withdrawn,424.0,0.0,0.0,0.0
29350,FFF,2014J,680222,-81.0,12.0,269,F,South East Region,Lower Than A Level,10-20,0-35,0,180,N,Withdrawn,139.0,0.0,0.0,0.0
29515,FFF,2014J,685042,-17.0,12.0,269,M,South Region,HE Qualification,10-20,0-35,0,150,N,Withdrawn,1337.0,0.0,0.0,0.0
30034,FFF,2014J,2626417,-9.0,12.0,269,M,Yorkshire Region,Lower Than A Level,10-20,0-35,3,120,N,Withdrawn,342.0,0.0,0.0,0.0

In [38]:
test_data = final_data.copy()

In [39]:
data=test_data[["id_student","code_module","weighted_score","date_registration"]].reset_index(drop=True).drop_duplicates()
data

      id_student code_module  weighted_score  date_registration
0          11391         AAA            82.4             -159.0
1          28400         AAA            65.4              -53.0
2          30268         AAA             NaN              -92.0
3          31604         AAA            76.3              -52.0
4          32885         AAA            55.0             -176.0
...          ...         ...             ...                ...
32588    2640965         GGG             NaN               -4.0
32589    2645731         GGG             NaN              -23.0
32590    2648187         GGG             NaN             -129.0
32591    2679821         GGG             NaN              -49.0
32592    2684003         GGG             NaN              -28.0

[32588 rows x 4 columns]

In [42]:

train, test = python_stratified_split(data, ratio=0.75, col_user='id_student', col_item='code_module', seed=42)

In [43]:
train.head()

      id_student code_module  weighted_score  date_registration
14394       3733         DDD             NaN              -68.0
383         6516         AAA           63.50              -52.0
17560       8462         DDD           21.50              -38.0
14395       8462         DDD           17.45             -137.0
0          11391         AAA           82.40             -159.0

In [44]:
test

      id_student code_module  weighted_score  date_registration
23924      51576         FFF         84.0000             -129.0
16350      69489         DDD             NaN              -23.0
14441      80329         DDD          6.9750              -61.0
14469     123598         DDD         74.2375              -32.0
19392     141301         EEE             NaN             -159.0
...          ...         ...             ...                ...
30035    2630284         FFF         19.7500              -13.0
19346    2648271         DDD          4.5000              -92.0
16322    2681198         DDD         12.4375             -113.0
16328    2691780         DDD             NaN              -73.0
30057    2697921         FFF         84.2500              -32.0

[244 rows x 4 columns]

In [45]:
logging.basicConfig(level=logging.DEBUG, 
                    format='%(asctime)s %(levelname)-8s %(message)s')

model = SAR(
    col_user="id_student",
    col_item="code_module",
    col_rating="weighted_score",
    col_timestamp="date_registration",
    similarity_type="jaccard", 
    time_decay_coefficient=30, 
    timedecay_formula=True,
    normalize=True
)

In [50]:
# Other model to test

In [51]:
with Timer() as train_time:
    model.fit(train)

print("Took {} seconds for training.".format(train_time.interval))

2023-03-03 07:07:54,257 INFO     Collecting user affinity matrix
2023-03-03 07:07:54,265 INFO     Calculating time-decayed affinities
2023-03-03 07:07:54,329 INFO     Creating index columns
2023-03-03 07:07:54,457 INFO     Calculating normalization factors
2023-03-03 07:07:54,537 INFO     Building user affinity sparse matrix
2023-03-03 07:07:54,545 INFO     Calculating item co-occurrence
2023-03-03 07:07:54,553 INFO     Calculating item similarity
2023-03-03 07:07:54,553 INFO     Using jaccard based similarity
2023-03-03 07:07:54,561 INFO     Done training

Took 0.3209469999999328 seconds for training.

In [47]:
with Timer() as test_time:
    top_k = model.recommend_k_items(test, top_k=8, remove_seen=True)

print("Took {} seconds for prediction.".format(test_time.interval))

2023-03-03 07:06:54,548 INFO     Calculating recommendation scores
2023-03-03 07:06:54,556 INFO     Removing seen items
2023-03-03 07:06:54,556 WARNING  Number of items is less than top_k, limiting top_k to number of items

Took 0.01397240000005695 seconds for prediction.

In [49]:
d = {'id_student': [1], 'code_module': ['AAA']}
input_test = pd.DataFrame(data=d)
filename = 'finalized_model.sav'
loaded_model = pickle.load(open(filename, 'rb'))
# result
result=model.recommend_k_items(test, top_k=7, remove_seen=True)["code_module"]
print(result)

2023-03-03 07:07:28,907 INFO     Calculating recommendation scores
2023-03-03 07:07:28,907 INFO     Removing seen items

0       EEE
1       DDD
2       FFF
3       BBB
4       AAA
       ...
1701    CCC
1702    EEE
1703    BBB
1704    GGG
1705    AAA
Name: code_module, Length: 1348, dtype: object

In [68]:
final_data.to_csv('final_data.csv')

In [123]:
final_data

,code_module,code_presentation,id_student,date_registration,date_unregistration,module_presentation_length,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result,total_click,weighted_score,late_rate,fail_rate
0,AAA,2013J,11391,-159.0,NaN,268,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,934.0,82.4,0.000000,0.0
1,AAA,2013J,28400,-53.0,NaN,268,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass,1435.0,65.4,0.400000,0.0
2,AAA,2013J,30268,-92.0,12.0,268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn,281.0,NaN,NaN,NaN
3,AAA,2013J,31604,-52.0,NaN,268,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass,2158.0,76.3,0.000000,0.0
4,AAA,2013J,32885,-176.0,NaN,268,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass,1034.0,55.0,1.000000,0.4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32588,GGG,2014J,2640965,-4.0,NaN,269,F,Wales,Lower Than A Level,10-20,0-35,0,30,N,Fail,41.0,NaN,NaN,NaN
32589,GGG,2014J,2645731,-23.0,NaN,269,F,East Anglian Region,Lower Than A Level,40-50%,35-55,0,30,N,Distinction,893.0,NaN,0.222222,0.0
32590,GGG,2014J,2648187,-129.0,NaN,269,F,South Region,A Level or Equivalent,20-30%,0-35,0,30,Y,Pass,312.0,NaN,0.000000,0.0
32591,GGG,2014J,2679821,-49.0,101.0,269,F,South East Region,Lower Than A Level,90-100%,35-55,0,30,N,Withdrawn,275.0,NaN,0.000000,0.0
32592,GGG,2014J,2684003,-28.0,NaN,269,F,Yorkshire Region,HE Qualification,50-60%,35-55,0,30,N,Distinction,616.0,NaN,0.000000,0.0

In [34]:
data[data["id_student"]==51576]

      id_student code_module  weighted_score  date_registration
8667       51576         CCC            4.64             -100.0
10611      51576         CCC            5.21              -85.0
23924      51576         FFF           84.00             -129.0

In [56]:
filename = 'finalized_model.sav'
pickle.dump(model, open(filename, 'wb'))

In [40]:
if code_module == "AAA": 
    rating = TMA * 0.5 + exam * 0.5
elif code_module == "BBB": 
    if code_presentation == '2014J': rating == TMA * 0.5 + exam * 0.5
    else: rating = CMA * 0.025 + TMA * 0.475 + exam * 0.5
elif code_module == "CCC":
    rating = (CMA * 0.125 + TMA * 0.375)*2/3 + exam * 0.66
elif code_module == "DDD":
    if code_presentation = '2014J': rating = CMA * 0.125 + TMA * 0.375 + exam * 0.5
    else: rating = TMA * 0.5 + exam * 0.5
elif code_module == "EEE":
    rating = TMA * 0.5 + exam * 0.5
elif code_module == "FFF":
    rating = TMA * 0.5 + exam * 0.5
elif code_module == "GGG":
    rating = exam

SyntaxError: invalid syntax (<ipython-input-40-3f28b470d5e6>, line 9)

In [ ]:
# Test mongodb with pymongo inside py

In [46]:
client = MongoClient('mongodb+srv://rubberduck:la2023@cluster0.mqzk6yg.mongodb.net/?retryWrites=true&w=majority')
db = client.project_db
student_info = db.TestDB
student_info.insert_one(
                    {'conde_module': 'code_module', 'code_presentation': 'semester', 'id_student': 100000000,
                     'gender': 1, 'region': 1, 'highest_education': 1, 'age_band': 1})

In [47]:
db = client.project_db

In [48]:
student_info = db.studentInfo

In [49]:
student_info.insert_one(
                    {'conde_module': 'code_module', 'code_presentation': 'semester', 'id_student': 100000000,
                     'gender': 1, 'region': 1, 'highest_education': 1, 'age_band': 1})

In [47]:
final_data

       id_student code_module  weighted_score  date_registration
0           11391         AAA            82.4             -159.0
1           28400         AAA            65.4              -53.0
2           30268         AAA             NaN              -92.0
3           31604         AAA            76.3              -52.0
4           32885         AAA            55.0             -176.0
...           ...         ...             ...                ...
32583     2640965         GGG             NaN               -4.0
32584     2645731         GGG             NaN              -23.0
32585     2648187         GGG             NaN             -129.0
32586     2679821         GGG             NaN              -49.0
32587     2684003         GGG             NaN              -28.0

[32588 rows x 4 columns]

In [161]:
ass[ass["code_module"]=="AAA"]

   code_module code_presentation  id_assessment assessment_type   date  weight
0          AAA             2013J           1752             TMA   19.0    10.0
1          AAA             2013J           1753             TMA   54.0    20.0
2          AAA             2013J           1754             TMA  117.0    20.0
3          AAA             2013J           1755             TMA  166.0    20.0
4          AAA             2013J           1756             TMA  215.0    30.0
5          AAA             2013J           1757            Exam    NaN   100.0
6          AAA             2014J           1758             TMA   19.0    10.0
7          AAA             2014J           1759             TMA   54.0    20.0
8          AAA             2014J           1760             TMA  117.0    20.0
9          AAA             2014J           1761             TMA  166.0    20.0
10         AAA             2014J           1762             TMA  215.0    30.0
11         AAA             2014J           1763            Exam    NaN   100.0

In [159]:
# merge with an inner join
assResults = pd.merge(ass, results, on=['id_assessment'], how='left')
# Rearrange column names
assResults = assResults[['id_student', 'code_module','assessment_type','weight', 'score','code_presentation']]
#assResults_ass=assResults[assResults["assessment_type"]=="Exam"]
# (a) Add column multiplying weight and score
assResults['weight*score'] = assResults['weight']*assResults['score']
#
assResults[["code_module","code_presentation","assessment_type"]].drop_duplicates()

       code_module code_presentation assessment_type
0              AAA             2013J             TMA
1633           AAA             2013J            Exam
1634           AAA             2014J             TMA
3150           AAA             2014J            Exam
3151           BBB             2013B             CMA
8200           BBB             2013B             TMA
14407          BBB             2013B            Exam
14408          BBB             2013J             CMA
20824          BBB             2013J             TMA
28783          BBB             2013J            Exam
28784          BBB             2014B             CMA
33277          BBB             2014B             TMA
38777          BBB             2014B            Exam
38778          BBB             2014J             TMA
46186          BBB             2014J            Exam
46187          CCC             2014B             CMA
50107          CCC             2014B             TMA
52929          CCC             2014B            Exam
53677          CCC             2014J             CMA
59523          CCC             2014J             TMA
63960          CCC             2014J            Exam
65129          DDD             2013B             CMA
70381          DDD             2013B             TMA
74900          DDD             2013B            Exam
75502          DDD             2013J             TMA
82470          DDD             2013J            Exam
83438          DDD             2014B             TMA
87456          DDD             2014B            Exam
87980          DDD             2014J             TMA
95043          DDD             2014J            Exam
95993          EEE             2013J             TMA
98877          EEE             2013J            Exam
98878          EEE             2014B             TMA
100658         EEE             2014B            Exam
100659         EEE             2014J             TMA
103888         EEE             2014J            Exam
103889         FFF             2013B             CMA
110570         FFF             2013B             TMA
116084         FFF             2013B            Exam
116085         FFF             2013J             CMA
124932         FFF             2013J             TMA
132325         FFF             2013J            Exam
132326         FFF             2014B             CMA
137875         FFF             2014B             TMA
142522         FFF             2014B            Exam
142523         FFF             2014J             CMA
151438         FFF             2014J             TMA
158707         FFF             2014J            Exam
158708         GGG             2013J             CMA
162457         GGG             2013J             TMA
164658         GGG             2013J            Exam
164659         GGG             2014B             CMA
167722         GGG             2014B             TMA
169555         GGG             2014B            Exam
169556         GGG             2014J             CMA
172303         GGG             2014J             TMA
173929         GGG             2014J            Exam

In [91]:
assResults = pd.merge(ass, results, on=['id_assessment'], how='inner')

In [115]:
data[]

      id_student code_module  weighted_score  date_registration
0          11391         AAA            82.4             -159.0
1          28400         AAA            65.4              -53.0
2          30268         AAA             NaN              -92.0
3          31604         AAA            76.3              -52.0
4          32885         AAA            55.0             -176.0
...          ...         ...             ...                ...
32588    2640965         GGG             NaN               -4.0
32589    2645731         GGG             NaN              -23.0
32590    2648187         GGG             NaN             -129.0
32591    2679821         GGG             NaN              -49.0
32592    2684003         GGG             NaN              -28.0

[32588 rows x 4 columns]

In [158]:
d = {'id_student': [80329,80329,80329], 'code_module': ['AAA','BBB','CCC'],'weighted_score' : [1,2,3],'date_registration':[np.nan]*3}
input_test = pd.DataFrame(data=d)
filename = 'finalized_model.sav'
loaded_model = pickle.load(open(filename, 'rb'))
data = pd.read_csv('final.csv')
data = pd.concat([data,input_test])
data.tail(10)
loaded_model.fit(data)
# result
result=loaded_model.recommend_k_items(input_test, top_k=3, remove_seen=True)["code_module"][0]
print(result)

2023-01-30 00:09:05,647 INFO     Collecting user affinity matrix
2023-01-30 00:09:05,647 INFO     Calculating time-decayed affinities
2023-01-30 00:09:05,671 INFO     Creating index columns
2023-01-30 00:09:05,710 INFO     Calculating normalization factors
2023-01-30 00:09:05,735 INFO     Building user affinity sparse matrix
2023-01-30 00:09:05,735 INFO     Calculating item co-occurrence
2023-01-30 00:09:05,742 INFO     Calculating item similarity
2023-01-30 00:09:05,742 INFO     Using jaccard based similarity
2023-01-30 00:09:05,742 INFO     Done training
2023-01-30 00:09:05,742 INFO     Calculating recommendation scores
2023-01-30 00:09:05,750 INFO     Removing seen items

EEE

In [45]:
final_data= pd.read_csv('final.csv')

In [49]:
final_data

,code_module,code_presentation,id_student,date_registration,date_unregistration,module_presentation_length,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result,total_click,weighted_score,late_rate,fail_rate
0,AAA,2013J,11391,-159.0,NaN,268,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,934.0,82.4,0.000000,0.0
1,AAA,2013J,28400,-53.0,NaN,268,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass,1435.0,65.4,0.400000,0.0
2,AAA,2013J,30268,-92.0,12.0,268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn,281.0,NaN,NaN,NaN
3,AAA,2013J,31604,-52.0,NaN,268,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass,2158.0,76.3,0.000000,0.0
4,AAA,2013J,32885,-176.0,NaN,268,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass,1034.0,55.0,1.000000,0.4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32588,GGG,2014J,2640965,-4.0,NaN,269,F,Wales,Lower Than A Level,10-20,0-35,0,30,N,Fail,41.0,NaN,NaN,NaN
32589,GGG,2014J,2645731,-23.0,NaN,269,F,East Anglian Region,Lower Than A Level,40-50%,35-55,0,30,N,Distinction,893.0,NaN,0.222222,0.0
32590,GGG,2014J,2648187,-129.0,NaN,269,F,South Region,A Level or Equivalent,20-30%,0-35,0,30,Y,Pass,312.0,NaN,0.000000,0.0
32591,GGG,2014J,2679821,-49.0,101.0,269,F,South East Region,Lower Than A Level,90-100%,35-55,0,30,N,Withdrawn,275.0,NaN,0.000000,0.0
32592,GGG,2014J,2684003,-28.0,NaN,269,F,Yorkshire Region,HE Qualification,50-60%,35-55,0,30,N,Distinction,616.0,NaN,0.000000,0.0

In [50]:
data=final_data[["id_student", "highest_education", "region", "age_band", "gender","code_module","weighted_score","date_registration"]].reset_index(drop=True).drop_duplicates()
data=data.drop_duplicates(subset=["id_student", "highest_education", "region", "age_band", "gender","code_module"], keep="last").sort_values(by=["id_student"]).dropna()

In [51]:
df2 = data[["id_student","code_module","weighted_score"]]
df3=df2.groupby('id_student').agg(lambda x: list(x)).reset_index()
df3

       id_student code_module  weighted_score
0            6516       [AAA]          [63.5]
1            8462       [DDD]          [21.5]
2           11391       [AAA]          [82.4]
3           23629       [BBB]         [16.69]
4           23698       [CCC]        [74.985]
...           ...         ...             ...
21223     2698251       [DDD]       [51.3375]
21224     2698257       [AAA]          [69.4]
21225     2698535  [EEE, CCC]  [53.44, 4.685]
21226     2698577       [BBB]          [55.8]
21227     2698588       [BBB]          [92.4]

[21228 rows x 3 columns]

In [62]:
dat = data[["id_student", "highest_education", "region", "age_band", "gender","date_registration"]].drop_duplicates()
finalize = df3.merge(dat, how = 'left')

In [63]:
finalize

,id_student,code_module,weighted_score,highest_education,region,age_band,gender,date_registration
0,6516,[AAA],[63.5],HE Qualification,Scotland,55<=,M,-52.0
1,8462,[DDD],[21.5],HE Qualification,London Region,55<=,M,-38.0
2,11391,[AAA],[82.4],HE Qualification,East Anglian Region,55<=,M,-159.0
3,23629,[BBB],[16.69],Lower Than A Level,East Anglian Region,0-35,F,-47.0
4,23698,[CCC],[74.985],A Level or Equivalent,East Anglian Region,0-35,F,-110.0
...,...,...,...,...,...,...,...,...
22503,2698257,[AAA],[69.4],Lower Than A Level,East Midlands Region,0-35,M,-58.0
22504,2698535,"[EEE, CCC]","[53.44, 4.685]",Lower Than A Level,Wales,0-35,M,-74.0
22505,2698535,"[EEE, CCC]","[53.44, 4.685]",Lower Than A Level,Wales,0-35,M,-156.0
22506,2698577,[BBB],[55.8],Lower Than A Level,Wales,35-55,F,16.0
22507,2698588,[BBB],[92.4],HE Qualification,Yorkshire Region,0-35,F,4.0

In [107]:
finalize[finalize["id_student"]==2697921]

,id_student,code_module,weighted_score,highest_education,region,age_band,gender
28844,2697921,"[FFF, DDD]","[84.25, 0.0]",Lower Than A Level,East Anglian Region,0-35,M

In [73]:
df1=data.groupby(["id_student", "highest_education", "region", "age_band", "gender"])['code_module','weighted_score'].apply(list).reset_index(name='code_modules')

df2[df2["id_student"]==23798]

      id_student code_module  weighted_score
2516       23798         BBB           89.24

In [152]:
data.to_csv('final.csv', index=False)

In [47]:
d = {'id_student': [80329,80329,80329], 'code_module': ['AAA','BBB','CCC'],'weighted_score' : [1,2,np.nan],'date_registration':[np.nan]*3}
input_test = pd.DataFrame(data=d)
filename = 'finalized_model.sav'
loaded_model = pickle.load(open(filename, 'rb'))
data = pd.read_csv('final.csv')
data = pd.concat([data,input_test])
data.tail(10)

       id_student code_module  weighted_score  date_registration
32581     2608143         GGG             NaN              -45.0
32582     2620947         GGG             NaN              -23.0
32583     2640965         GGG             NaN               -4.0
32584     2645731         GGG             NaN              -23.0
32585     2648187         GGG             NaN             -129.0
32586     2679821         GGG             NaN              -49.0
32587     2684003         GGG             NaN              -28.0
0           80329         AAA             1.0                NaN
1           80329         BBB             2.0                NaN
2           80329         CCC             NaN                NaN

In [48]:
loaded_model.fit(data)

In [ ]:
test = {'id_student': [80329,80329,80329], 'code_module': ['AAA','BBB','CCC'],'weighted_score' : [1,2,np.nan],'date_registration':[np.nan]*3}

In [ ]:
loaded_model.recommend_k_items(test, top_k=8, remove_seen=True)

In [61]:
finalize

,id_student,code_module,weighted_score,highest_education,region,age_band,gender
0,6516,[AAA],[63.5],HE Qualification,Scotland,55<=,M
1,8462,[DDD],[21.5],HE Qualification,London Region,55<=,M
2,11391,[AAA],[82.4],HE Qualification,East Anglian Region,55<=,M
3,23629,[BBB],[16.69],Lower Than A Level,East Anglian Region,0-35,F
4,23698,[CCC],[74.985],A Level or Equivalent,East Anglian Region,0-35,F
...,...,...,...,...,...,...,...
21273,2698251,[DDD],[51.3375],A Level or Equivalent,South West Region,0-35,F
21274,2698257,[AAA],[69.4],Lower Than A Level,East Midlands Region,0-35,M
21275,2698535,"[EEE, CCC]","[53.44, 4.685]",Lower Than A Level,Wales,0-35,M
21276,2698577,[BBB],[55.8],Lower Than A Level,Wales,35-55,F
21277,2698588,[BBB],[92.4],HE Qualification,Yorkshire Region,0-35,F

In [67]:
from pymongo import MongoClient
client = MongoClient('mongodb+srv://rubberduck:la2023@cluster0.mqzk6yg.mongodb.net/?retryWrites=true&w=majority')
mydb = client["project_db"]
mycol = mydb["studentInfo_testv3"]

In [68]:
for line in finalize.index:
    my_dict = {"id_student": str(finalize["id_student"][line]),\
               "code_module": str(finalize["code_module"][line]),\
               "weighted_score": str(finalize["weighted_score"][line]),\
               "highest_education": str(finalize["highest_education"][line]),\
               "region": str(finalize["region"][line]),\
               "age_band": str(finalize["age_band"][line]),\
               "gender": str(finalize["gender"][line]),
               "date_registration": str(finalize["date_registration"][line])
              }

    x = mycol.insert_one(my_dict)

In [66]:
finalize[finalize["id_student"]==28400]

,id_student,code_module,weighted_score,highest_education,region,age_band,gender,date_registration
28,28400,[AAA],[65.4],HE Qualification,Scotland,35-55,F,-53.0

In [72]:
finalize

,id_student,code_module,weighted_score,highest_education,region,age_band,gender,date_registration
0,6516,[AAA],[63.5],HE Qualification,Scotland,55<=,M,-52.0
1,8462,[DDD],[21.5],HE Qualification,London Region,55<=,M,-38.0
2,11391,[AAA],[82.4],HE Qualification,East Anglian Region,55<=,M,-159.0
3,23629,[BBB],[16.69],Lower Than A Level,East Anglian Region,0-35,F,-47.0
4,23698,[CCC],[74.985],A Level or Equivalent,East Anglian Region,0-35,F,-110.0
...,...,...,...,...,...,...,...,...
22503,2698257,[AAA],[69.4],Lower Than A Level,East Midlands Region,0-35,M,-58.0
22504,2698535,"[EEE, CCC]","[53.44, 4.685]",Lower Than A Level,Wales,0-35,M,-74.0
22505,2698535,"[EEE, CCC]","[53.44, 4.685]",Lower Than A Level,Wales,0-35,M,-156.0
22506,2698577,[BBB],[55.8],Lower Than A Level,Wales,35-55,F,16.0
22507,2698588,[BBB],[92.4],HE Qualification,Yorkshire Region,0-35,F,4.0

In [69]:
a = ["a","b"]
str(a)

"['a', 'b']"

In [71]:
df.code_module = df.code_module.fillna(0)

In [ ]:
mydb = client["project_db"]
mycol = mydb["studentInfo"]

mydict = { "name": "John", "address": "Highway 37" }

x = mycol.insert_one(mydict)

In [154]:
assessment_type_1 = "TMA"
assessment_type_2 = 'Exam'
assessment_type_3 = "CMA"

score_1=1
score_2=2
score_3=3

In [155]:
list_ass

['TMA', 'Exam', 'CMA']

In [156]:
list_ass = [assessment_type_1,assessment_type_2,assessment_type_3]
list_score = [score_1,score_2,score_3]
if 'CMA' in list_ass:
    CMA = list_score[list_ass.index('CMA')]
if 'TMA' in list_ass:
    TMA = list_score[list_ass.index('TMA')]
if 'Exam' in list_ass:
    Exam = list_score[list_ass.index('Exam')]

In [228]:
savedf= df

In [269]:
mydb = client["project_db"]
mycol = mydb["studentInfo_test"]

cursor = mycol.find({})
    # Expand the cursor and construct the DataFrame
df =  pd.DataFrame(list(cursor))
    # Delete the _id
if True:
        del df['_id']
df.code_module = df.code_module.apply(lambda x: x[1:-1].replace("'", "").split(","))
df.weighted_score = df.weighted_score.apply(lambda x: x[1:-1].replace("'", "").split(","))
df = df.explode("code_module")
df = df.explode("weighted_score")
df = df.drop_duplicates(subset=['id_student', 'code_module'], keep='first')
df.weighted_score = df.weighted_score.apply(lambda x: int(float(x)))
print(df)

      id_student code_module  weighted_score      highest_education  \
0           3733         DDD               0       HE Qualification
1           6516         AAA              63       HE Qualification
2           8462         DDD              21       HE Qualification
3          11391         AAA              82       HE Qualification
4          23629         BBB              16     Lower Than A Level
...          ...         ...             ...                    ...
28852    2698591         BBB               0     Lower Than A Level
28853    2702660         FFF               0     Lower Than A Level
28854    2707979         DDD               0     Lower Than A Level
28855    2710343         DDD               0     Lower Than A Level
28856    2716795         DDD               0  A Level or Equivalent

                     region age_band gender
0              South Region     55<=      M
1                  Scotland     55<=      M
2             London Region     55<=      M
3       East Anglian Region     55<=      M
4       East Anglian Region     0-35      F
...                     ...      ...    ...
28852                 Wales    35-55      F
28853         London Region     0-35      F
28854  East Midlands Region     0-35      F
28855  North Western Region     0-35      M
28856         London Region     0-35      F

[31315 rows x 7 columns]

In [270]:
df[df["code_module"]== "AAA")&(df[])]

,id_student,code_module,weighted_score,highest_education,region,age_band,gender
0,3733,DDD,0,HE Qualification,South Region,55<=,M
1,6516,AAA,63,HE Qualification,Scotland,55<=,M
2,8462,DDD,21,HE Qualification,London Region,55<=,M
3,11391,AAA,82,HE Qualification,East Anglian Region,55<=,M
4,23629,BBB,16,Lower Than A Level,East Anglian Region,0-35,F
...,...,...,...,...,...,...,...
28852,2698591,BBB,0,Lower Than A Level,Wales,35-55,F
28853,2702660,FFF,0,Lower Than A Level,London Region,0-35,F
28854,2707979,DDD,0,Lower Than A Level,East Midlands Region,0-35,F
28855,2710343,DDD,0,Lower Than A Level,North Western Region,0-35,M
28856,2716795,DDD,0,A Level or Equivalent,London Region,0-35,F

In [266]:
#take data to df
cursor = student_info.find({})
    # Expand the cursor and construct the DataFrame
df =  pd.DataFrame(list(cursor))
    # Delete the _id
if True:
        del df['_id']
        

rest_module = [x for x in all_module if x not in code_module]

# input data
d = {'id_student': [id_student]*len(rest_module), 'code_module': rest_module,\
     'weighted_score' : [np.nan]*len(rest_module),'date_registration':[np.nan]*len(rest_module)}

input_test = pd.DataFrame(data=d)

filename = 'finalized_model.sav'
loaded_model = pickle.load(open(filename, 'rb'))
loaded_model.fit(df)

# result
result=loaded_model.recommend_k_items(output_test, top_k=3, remove_seen=True)["code_module"][0]
print(result)

NameError: name 'student_info' is not defined

In [245]:
df

,id_student,code_module,weighted_score,highest_education,region,age_band,gender
0,3733,[DDD],[0.0],HE Qualification,South Region,55<=,M
1,6516,[AAA],[63.5],HE Qualification,Scotland,55<=,M
2,8462,[DDD],[21.5],HE Qualification,London Region,55<=,M
3,11391,[AAA],[82.4],HE Qualification,East Anglian Region,55<=,M
4,23629,[BBB],[16.69],Lower Than A Level,East Anglian Region,0-35,F
...,...,...,...,...,...,...,...
28852,2698591,[BBB],[0.0],Lower Than A Level,Wales,35-55,F
28853,2702660,[FFF],[0.0],Lower Than A Level,London Region,0-35,F
28854,2707979,[DDD],[0.0],Lower Than A Level,East Midlands Region,0-35,F
28855,2710343,[DDD],[0.0],Lower Than A Level,North Western Region,0-35,M
28856,2716795,[DDD],[0.0],A Level or Equivalent,London Region,0-35,F

In [222]:
df.explode("code_module")

,id_student,code_module,weighted_score,highest_education,region,age_band,gender,code_presentation
0,3733,['DDD'],[0.0],HE Qualification,South Region,55<=,M,NaN
1,6516,['AAA'],[63.5],HE Qualification,Scotland,55<=,M,NaN
2,8462,['DDD'],[21.5],HE Qualification,London Region,55<=,M,NaN
3,11391,['AAA'],[82.4],HE Qualification,East Anglian Region,55<=,M,NaN
4,23629,['BBB'],[16.69],Lower Than A Level,East Anglian Region,0-35,F,NaN
...,...,...,...,...,...,...,...,...
28875,408261,BBB,NaN,HE Qualification,East Anglian Region,33,M,2013B
28876,408261,DDD,NaN,HE Qualification,East Anglian Region,33,M,2014J
28877,780653,AAA,NaN,HE Qualification,East Anglian Region,23,M,2013J
28878,780653,BBB,NaN,HE Qualification,East Anglian Region,23,M,2014J
28879,780653,CCC,NaN,HE Qualification,East Anglian Region,23,M,2014J

In [129]:
all_module = ["AAA","BBB","CCC","DDD","EEE","FFF","GGG"]
code_module = ["AAA"]
rest_module = [x for x in all_module if x not in code_module]
id_student = 1

# input data
d = {'id_student': [id_student]*len(rest_module), 'code_module': rest_module,\
     'weighted_score' : [np.nan]*len(rest_module),'date_registration':[np.nan]*len(rest_module)}
d

{'id_student': [1, 1, 1, 1, 1, 1],
 'code_module': ['BBB', 'CCC', 'DDD', 'EEE', 'FFF', 'GGG'],
 'weighted_score': [nan, nan, nan, nan, nan, nan],
 'date_registration': [nan, nan, nan, nan, nan, nan]}